{
  "achievements": [
    {
      "id": 1,
      "title": "Iris Digital",
      "type": "professional",
      "img": "Iris-Digital.png",
      "carousel": [
        "Iris-Digital-1",
        "Iris-Digital-2",
        "Iris-Digital-3",
        "Iris-Digital-4",
        "Iris-Digital-5"
      ],
      "short_desc": "J'ai intégré une maquette avec Vue.js pour créer un site vitrine avec des animations, un design responsive, et une optimisation SEO, permettant à l'entreprise de renforcer sa crédibilité et d'attirer de nouveaux clients.",
      "long_desc": [
        "Ce projet consistait à développer le site vitrine de l'entreprise Iris Digital en intégrant une maquette réalisée par une designeuse. Mon rôle principal a été de convertir cette vision créative en un site web fonctionnel et responsive, en utilisant le framework Vue.js.",
        "L'un des principaux défis de ce projet a été de gérer la grande quantité de code, ainsi que les nombreuses animations et transitions qui apportaient une dimension interactive au site. En plus de cela, la transition vers un design responsive a nécessité une attention particulière, afin que le site s'adapte parfaitement aux différents appareils, du mobile à l'écran de bureau. L'amélioration du SEO était également un enjeu clé pour accroître la visibilité en ligne de l'entreprise.",
        "L'objectif final de ce site était double : offrir une interface moderne et efficace pour que l'entreprise puisse communiquer avec ses clients, mais aussi prouver son expertise en matière de développement web, renforçant ainsi sa crédibilité auprès de potentiels nouveaux clients. Ce projet a été une réussite, car il a permis à l'entreprise d'attirer un client sérieux pour lequel j'ai ensuite réalisé un autre site."
      ],
      "github": "https://github.com/Iris-Digital-Sas/Iris-front",
      "link": "https://iris-digital.fr/#/"
    },
    {
      "id": 2,
      "title": "Artisanat Van",
      "type": "professional",
      "img": "Artisanat-Van.png",
      "carousel": [
        "Artisanat-Van-1",
        "Artisanat-Van-2",
        "Artisanat-Van-3",
        "Artisanat-Van-4",
        "Artisanat-Van-5"
      ],
      "short_desc": "J'ai intégré une maquette pour un site vitrine présentant les services et points forts du client avec des animations et un design attrayant. Le site, responsive et optimisé pour le SEO, a satisfait pleinement le client.",
      "long_desc": [
        "Pour le projet Artisanat Van, j'ai intégré seul une maquette afin de créer un site vitrine dynamique et attrayant, visant à présenter les services et points forts du client. Le site, développé en Vue.js, met l'accent sur une interface soignée, des animations fluides, et un SEO optimisé pour garantir une bonne visibilité en ligne.",
        "Dans le cadre de ce projet, mon rôle a été d'intégrer une maquette fournie par le client pour créer un site vitrine professionnel. Le client, spécialisé dans l'artisanat, souhaitait une interface visuellement attrayante pour présenter ses services de manière efficace et captivante. Le défi majeur était de mettre en place de nombreuses animations tout en garantissant une transition fluide vers un design responsive, afin que le site fonctionne parfaitement sur tous les appareils.",
        "J'ai utilisé Vue.js pour développer ce site, en veillant à ce que l'optimisation du SEO soit au centre de la stratégie, ce qui a permis au client d'améliorer sa visibilité en ligne. Le projet a été couronné de succès, le client étant pleinement satisfait du résultat final. Grâce à cette expérience, nos relations professionnelles sont restées positives et cordiales."
      ],
      "github": "",
      "link": "https://www.artisanat-van.fr/"
    },
    {
      "id": 3,
      "title": "Kasa",
      "type": "education",
      "img": "Kasa.png",
      "carousel": ["Kasa-1", "Kasa-2", "Kasa-3", "Kasa-4"],
      "short_desc": "J'ai intégré une maquette en React.js pour maîtriser ce framework. J'ai développé des composants réutilisables, comme un carousel et des cards, tout en assurant une navigation fluide et un site responsive.",
      "long_desc": [
        "Dans ce projet, mon rôle consistait à intégrer une maquette en utilisant React.js, avec l'objectif principal de comprendre et de maîtriser ce framework. J'ai appris à structurer mon code en micro-composants réutilisables pour améliorer la lisibilité et la maintenance du code.",
        "Un des principaux défis a été de créer manuellement des composants comme un carousel, un composant collapse, et des cards. J'ai également mis en place un routing logique pour organiser la navigation du site, y compris une route 404 pour gérer les erreurs de pages inexistantes.",
        "Le projet devait également être responsive, afin de s'adapter à tous les formats d'écran. Ce projet a été validé rapidement, et mon mentor a été impressionné par ma capacité à livrer un travail de qualité en un temps réduit."
      ],
      "github": "https://github.com/BastianGH/Kasa",
      "link": ""
    },
    {
      "id": 4,
      "title": "Hot Takes",
      "type": "education",
      "img": "Hot-Takes.png",
      "carousel": ["Hot-Takes-1", "Hot-Takes-2", "Hot-Takes-3", "Hot-Takes-4"],
      "short_desc": "Création d'une API REST sécurisée avec gestion des opérations CRUD, authentification, et connexion à MongoDB Atlas, tout en assurant la sécurité des données et la gestion des fichiers.",
      "long_desc": [
        "Mon rôle dans ce projet était de créer une API REST complète à partir de zéro pour un frontend déjà conçu et fourni. L'objectif principal était d'apprendre à construire un serveur backend en implémentant des fonctions CRUD (Create, Read, Update, Delete) avec une architecture propre basée sur des modèles, des routes, et des contrôleurs.",
        "J'ai conçu et structuré manuellement tous les fichiers nécessaires, notamment pour connecter la base de données MongoDB Atlas, tout en gérant les politiques CORS pour autoriser les échanges sécurisés entre le backend et le frontend. Un système d'authentification basé sur un middleware a été mis en place pour sécuriser l'accès aux différentes routes, garantissant que seules les requêtes autorisées pouvaient interagir avec la base de données.",
        "Pour renforcer la sécurité des données, j'ai utilisé des modèles pour valider et protéger les entrées, limitant les risques d'attaques telles que l'injection SQL. De plus, j'ai intégré Multer pour gérer le téléchargement et la mise à jour des fichiers images. Grâce à ces outils, l'API permettait une gestion sécurisée des utilisateurs et des données.",
        "Le projet a été validé par l'examinateur, confirmant l'efficacité de l'API et des bonnes pratiques de sécurité mises en place."
      ],
      "github": "https://github.com/BastianGH/Projet-6-OpenClassroom",
      "link": ""
    },
    {
      "id": 5,
      "title": "Kanap",
      "type": "education",
      "img": "Kanap.png",
      "carousel": [
        "Kanap-1",
        "Kanap-2",
        "Kanap-3",
        "Kanap-4",
        "Kanap-5",
        "Kanap-6"
      ],
      "short_desc": "J'ai rendu dynamique un frontend préconçu en utilisant JavaScript pour interagir avec un backend via des requêtes AJAX, en générant des éléments HTML et en structurant le code de manière claire.",
      "long_desc": [
        "Dans ce projet, j'avais pour mission de rendre la partie frontend dynamique à partir d'un frontend et backend préconçus. L'objectif était d'approfondir mes compétences en JavaScript, notamment dans l'utilisation de requêtes AJAX pour récupérer et envoyer des données.",
        "J'ai dû générer des éléments HTML de manière dynamique en fonction des données reçues tout en structurant le code de manière claire, réutilisable et maintenable. De plus, l'organisation du projet en plusieurs fichiers, accompagnée de commentaires explicatifs, a permis de rendre chaque partie du code plus lisible et compréhensible. J'ai également veillé à assurer la compatibilité du projet avec différents navigateurs pour garantir une expérience utilisateur fluide et cohérente.",
        "L'objectif final était d'intégrer pleinement JavaScript dans la gestion des données front-end afin de dynamiser l'interface. Le projet a été validé par l'examinateur, démontrant ainsi ma capacité à utiliser JavaScript pour manipuler efficacement les DOM et interagir avec des APIs."
      ],
      "github": "https://github.com/BastianGH/Projet-5-OpenClassroom",
      "link": ""
    },
    {
      "id": 6,
      "title": "La Panthère",
      "type": "education",
      "img": "La-Panthère.png",
      "carousel": ["La-Panthère-1", "La-Panthère-2", "La-Panthère-3"],
      "short_desc": "J'ai optimisé une page web en améliorant ses performances et son SEO à l'aide de Lighthouse. J'ai apporté des modifications au code et aux images pour offrir une meilleure expérience utilisateur. Le projet a été validé avec succès.",
      "long_desc": [
        "Mon rôle dans ce projet était d'optimiser une page web existante. L'objectif principal était d'apprendre et d'appliquer les bonnes pratiques en matière de SEO et d'UX design. Pour cela, j'ai dû revoir le code de la page et utiliser l'outil Lighthouse pour analyser les performances, l'accessibilité, les bonnes pratiques et le SEO du site. J'ai également appris à utiliser GitHub Pages pour \"déployer\" le site et tester les modifications apportées.",
        "Au cours de ce projet, j'ai apporté plusieurs modifications au code, retouché certaines images, et répertorié les changements effectués ainsi que leur impact sur la qualité du site. Cela m'a permis de prouver le bien-fondé de mes améliorations. Les technologies utilisées incluent HTML et CSS, ainsi que Paint pour la retouche d'images, tout en testant la compatibilité sur les principaux navigateurs web. L'examinateur a été satisfait du travail fourni et de la présentation des résultats."
      ],
      "github": "https://github.com/BastianGH/La-panthere",
      "link": "https://bastiangh.github.io/La-panthere/"
    },
    {
      "id": 7,
      "title": "Oh my food",
      "type": "education",
      "img": "Oh-my-food.png",
      "carousel": ["Kasa-1", "Kasa-2", "Kasa-3", "Kasa-4"],
      "short_desc": "J'ai intégré une maquette en utilisant Sass pour améliorer l'organisation de mon code et apprendre à utiliser GitHub. Le projet a été validé avec succès.",
      "long_desc": [
        "Mon rôle a été d'intégrer une maquette en utilisant Sass, remplaçant ainsi le CSS traditionnel. L'objectif principal du projet était d'apprendre à utiliser Sass et SCSS pour obtenir un code plus structuré et organisé, tout en découvrant l'utilisation de GitHub pour la gestion de version.",
        "Pour ce projet, j'ai dû organiser mon HTML avec des classes spécifiques pour faciliter le développement des styles. J'ai appris à maîtriser SCSS, en comprenant l'importance d'une structure claire des fichiers, et j'ai réalisé des animations complexes, telles que des spinners de chargement. De plus, j'ai veillé à ce que la page soit entièrement responsive.",
        "J'ai utilisé Sass ainsi que du simple HTML pour réaliser ce projet. L'examinateur a été satisfait de mon travail, ce qui a permis la validation du projet."
      ],
      "github": "https://github.com/BastianGH/Project-3-Openclassroom",
      "link": "https://bastiangh.github.io/Project-3-Openclassroom/"
    },
    {
      "id": 8,
      "title": "CodeBook",
      "type": "education",
      "img": "Code-Book.png",
      "carousel": [
        "Code-Book-1",
        "Code-Book-2",
        "Code-Book-3",
        "Code-Book-4",
        "Code-Book-5"
      ],
      "short_desc": "J'ai développé un site d'administration pour gérer les produits d'un site utilisateur, en utilisant React et Firebase pour la gestion des données. Le projet a été validé avec succès.",
      "long_desc": [
        "Mon rôle a été de créer un site dédié à l'administration des produits utilisés côté utilisateur. Nous avons mis en place deux sites distincts avec deux frameworks différents : l'un destiné aux utilisateurs finaux et l'autre pour la gestion des produits.",
        "Pour le site d'administration, j'ai utilisé Firebase pour la gestion des données. J'ai donc édité les collections de la nouvelle base de données Firebase et créé un site comprenant un système d'authentification, qui est essentiel pour accéder au reste des fonctionnalités via un système de routing bien pensé. J'ai également implémenté des fonctions CRUD pour permettre aux utilisateurs ayant des privilèges appropriés de gérer les produits. De plus, les requêtes incluent une légère couche de vérification côté front, réalisée grâce à l'utilisation de Vee-validate.",
        "Pour développer le site, j'ai utilisé React comme framework principal, associé à Firebase pour la gestion des données. L'examinateur a exprimé sa satisfaction concernant le travail réalisé, ce qui a permis la validation du projet."
      ],
      "github": "",
      "link": ""
    }
  ]
}
